[
  {
    "name": "Godfather",
    "desc": "Role: The Godfather is the leader of the Mafia. They appear as an innocent townsperson when investigated by the Detective. Abilities: Innocent Appearance: When investigated by the Detective, the Godfather will show up as a Villager, making them difficult to identify as Mafia. Authority: The Godfather may have the final say in choosing the Mafia's target for elimination each night. \nObjective: Guide the Mafia to victory by coordinating attacks, deceiving the town, and avoiding detection. The Godfather must use their unique ability to mislead the town and protect their fellow Mafia members.",
    "avatar": "http://localhost:5173/src/assets/images/godfather.svg",
    "mafia": true
  },
  {
    "name": "Mafia",
    "desc": "Role: The Mafia members work together to eliminate the Villagers and avoid detection. Each night, they choose one player to eliminate. Objective: Deceive the town and eliminate all non-Mafia players without getting caught.",
    "avatar": "http://localhost:5173/src/assets/images/mafia.svg",
    "mafia": true
  },
  {
    "name": "Detective",
    "desc": "Role: Each night, the Detective can investigate one player to determine if they are a member of the Mafia or not. Objective: Use their investigations to identify and help eliminate the Mafia members, protecting the Villagers.",
    "avatar": "http://localhost:5173/src/assets/images/detective.svg",
    "mafia": false
  },
  {
    "name": "Doctor",
    "desc": "Role: Each night, the Doctor can choose one player to protect from being eliminated by the Mafia. \nObjective: Protect key town players (such as the Detective) and help the town survive long enough to eliminate the Mafia.",
    "avatar": "http://localhost:5173/src/assets/images/doctor.svg",
    "mafia": false
  },
  {
    "name": "Villager",
    "desc": "Role: Regular town members with no special abilities. They vote during the day to eliminate a player they suspect to be Mafia. Objective: Use discussion, logic, and social deduction to identify and votme out the Mafia members.",
    "avatar": "http://localhost:5173/src/assets/images/villager.svg",
    "mafia": false
  },
  {
    "name": "Witch",
    "desc": "Role: The Witch has the ability to role-block. Each night, they can choose one player to prevent them from using their night ability. Objective: Use their power to disrupt the town's actions and protect the Mafia. By blocking key town roles (such as the Detective or Doctor), the Witch can hinder the town's ability to protect and investigate, making it easier for the Mafia to eliminate the Villagers and win the game.",
    "avatar": "http://localhost:5173/src/assets/images/witch.svg",
    "mafia": true
  },
  {
    "name": "Leon",
    "desc": "Role: Leon could be a special role with unique abilities depending on the version of the game being played. For instance, Leon might have a single-use ability to revive a player, protect themselves, or have another unique skill. Objective: Depending on the specific rules, Leon's objective could vary but usually aligns with either the town's or the Mafia's goal, or they might have a unique win condition.",
    "avatar": "http://localhost:5173/src/assets/images/leon.svg",
    "mafia": false
  }
]
